"ose[-12028]" = "Ocorreu um erro interno";
"ospsqlite[-13008]" = "Não é possível enviar alterações para snapshots somente para leitura \"%s\"";
"bgsync[12405]" = "Retomar Pendente";
"ose[-12008]" = "%ld bytes para opcode '%c' não foram lidos";
"bgsync[-12545]" = "Falha ao pausar agente de sinc. (veja a causa)";
"olstd[-10204]" = "Entidade inválida: \"%s\"";
"ose[-12051]" = "URL de arquivo inválido especificado: \"%s\"";
"bgsync[12302]" = "Pausar";
"bgsync[12010]" = "A notificação do servidor da prioridade %d foi recebida para a publicação \"%s\"";
"osync_res[16110]" = "Publicações";
"bgsync[-12525]" = "Tipo inválido \"%s\" para uma regra de evento";
"ose[-12031]" = "Dados não reconhecidos recebidos";
"olstd[-10101]" = "A operação de E/S foi cancelada";
"ose[-12047]" = "Prioridade inválida especificada: %d";
"bgsync[12006]" = "A sincronização da prioridade %d foi iniciada para as publicações \"%s\"";
"ospsqlite[-13011]" = "Ocorreu um erro durante a execução do script \"%s\"";
"bgsync[-12505]" = "Ocorreu um erro no gerenciador de rede (veja a causa)";
"olstd[0]" = "Não há erro";
"osync_res[16106]" = "Nome da Rede";
"ose[-12011]" = "O plugin retornou o erro %ld: %s";
"ose[-12027]" = "Handle inválido fornecido";
"ospsqlite[-13007]" = "Snapshot \"%s\", coluna \"%s\": as colunas blob não são permitidas na chave primária";
"bgsync[12404]" = "Pausado";
"ose[15003]" = "Os dados do cliente foram importados. Isso conclui o upgrade do cliente.";
"osync_res[16003]" = "Concluído";
"ose[-12007]" = "Não é possível ler %ld bytes para opcode '%c', somente %ld bytes permanecem";
"bgsync[-12544]" = "Falha ao interromper agente de sinc. (veja a causa)";
"olstd[-10203]" = "Escape de caractere incorreto: \"%s\"";
"bgsync[12301]" = "Interromper";
"ose[-12050]" = "Direção de transporte inválida especificada: %d";
"bgsync[-12524]" = "Subtipo inválido \"%s\" para uma regra de condição";
"olstd[-10100]" = "Final de fluxo de entrada atingido";
"ose[-12030]" = "O id da criptografia enviado (%lu,%lu+1) não corresponde ao recebido (%lu,%lu)";
"ose[-12046]" = "Apontador de buffer ou tamanho de buffer inválido especificado";
"bgsync[12005]" = "A composição da prioridade %d foi concluída para o banco de dados \"%s\"";
"bgsync[-12504]" = "Falha ao avaliar regra \"%s\" para a publicação \"%s\"";
"ospsqlite[-13010]" = "Informações de índices inválidas recebidas para o índice \"%s\"";
"osync_res[16105]" = "Id do Cliente";
"ose[-12010]" = "O plugin retornou flags inválidos '%x'";
"ose[-12026]" = "Handle de sessão inválido fornecido";
"ospsqlite[-13006]" = "Não foi possível encontrar snapshot com id %ld";
"bgsync[12403]" = "Pausa pendente";
"ose[15002]" = "Os bancos de dados do cliente foram configurados. Sincronize novamente para importar os dados do arquivo binário gerado durante a fase de exportação. Se quiser especificar a localização personalizada deste arquivo, use as opções de sincronização do Arquivo.";
"osync_res[16002]" = "Cancelar";
"ose[-12006]" = "Opcode %d inválido recebido";
"bgsync[-12543]" = "Falha ao iniciar agente de sinc. (veja a causa)";
"olstd[-10202]" = "Escape sem terminação: \"%.*s\"";
"olstd[-10009]" = "Foi encontrado um ponteiro ou handle nulo: %s";
"bgsync[12300]" = "Iniciar";
"bgsync[-12523]" = "Subtipo inválido \"%s\" para uma regra de evento";
"bgsync[-12539]" = "Não é possível iniciar o agente de sincronização porque ele foi desativado";
"ose[-12045]" = "O API ou recurso \"%s\" não é suportado";
"bgsync[12004]" = "A composição da prioridade %d foi iniciada para o banco de dados \"%s\"";
"bgsync[-12503]" = "Não foi possível carregar regra \"%s\" para a publicação \"%s\" (veja a causa)";
"osync_res[16104]" = "Id do Processo";
"bgsync[-12519]" = "Subtipo de regra inválida: \"%s\"";
"ose[-12025]" = "Versão de transporte de criptografia inválida especificada: %d";
"ospsqlite[-13005]" = "Os dados da coluna grande (> 64K) não são suportados";
"bgsync[12402]" = "Em execução";
"ose[15001]" = "Os dados do banco de dados foram exportados. Continue o upgrade do cliente.";
"osync_res[16001]" = "OK";
"ose[-12005]" = "Tipo de DML de registro inválido %d obtido no plugin";
"bgsync[-12542]" = "Parâmetro especificado inválido: %d";
"olstd[-10201]" = "String não encontrada \"%s\" no xml";
"olstd[-10008]" = "String Hex inválida: \"%s\"";
"bgsync[-12522]" = "Formato de data inválido: \"%s\"";
"bgsync[-12538]" = "A leitora da mensagem foi cancelada de outro thread";
"ose[-12044]" = "Falha ao carregar a biblioteca de plug-ins \"%s\" (veja a causa)";
"bgsync[12003]" = "O agente de sincronização foi retomado";
"bgsync[12504]" = "Processar";
"bgsync[-12502]" = "A aplicação falhou para o banco de dados \"%s\" (veja a causa)";
"osync_res[16103]" = "Nome da Aplicação";
"bgsync[-12518]" = "Tipo de regra inválida: \"%s\"";
"ose[-12024]" = "Opcode '%c' recebido fora da sequência";
"olstd[-10303]" = "Não é possível usar o scheduler porque ele sofreu shutdown";
"olstd[-1]" = "Erro desconhecido";
"ospsqlite[-13004]" = "Dados inválidos na coluna STATE";
"bgsync[12401]" = "Início Pendente";
"ose[15000]" = "N/A (Modo de Exportação)";
"osync_res[16000]" = "Andamento da Sincronização";
"ose[-12004]" = "A senha não foi especificada e não foi salva para o usuário \"%s\"";
"olstd[-10200]" = "Não foi possível localizar o atributo \"%s\" na tag \"%s\"";
"olstd[-10007]" = "String de data inválida especificada: \"%s\"";
"bgsync[-12541]" = "Falha ao avaliar regras para o banco de dados\"%s\" porque elas estão bloqueadas por uma aplicação";
"bgsync[-12521]" = "Subtipo de regra inválida \"%s\" para o tipo de regra \"%s\"";
"bgsync[-12537]" = "Não é possível criar a leitora de mensagem porque o número máximo permitido de %d leitoras em execução será excedido";
"ose[-12043]" = "Não foi possível encontrar o id da publicação %lu";
"bgsync[12002]" = "O agente de sincronização foi pausado";
"bgsync[12503]" = "Receber";
"bgsync[-12501]" = "A sincronização da prioridade %d falhou para as publicações \"%s\" (veja a causa)";
"osync_res[16102]" = "Status";
"bgsync[-12517]" = "Não foi possível encontrar o banco de dados da plataforma";
"ose[-12023]" = "O snapshot com id %ld já existe";
"olstd[-10302]" = "Não é possível usar o pool de threads porque ele sofreu shutdown";
"ose[-12039]" = "Ocorreu um erro interno (veja a causa)";
"ospsqlite[-13003]" = "Definição de chave primária inválida recebida";
"bgsync[12400]" = "Interrompido";
"ose[-12003]" = "O usuário não foi especificado, e o último usuário não foi registrado";
"ose[-12019]" = "Não foi possível encontrar publicação \"%s\"";
"olstd[-10006]" = "String com aspas incorretas: %s";
"bgsync[-12540]" = "Nenhuma publicação ativada de sincronização em segundo plano foi encontrada no cliente";
"olstd[-10215]" = "Valor inválido \"%s\" para o atributo \"%s\" na tag \"%s\"";
"bgsync[-12520]" = "Classe de regra inválida: \"%s\"";
"bgsync[-12536]" = "Não é possível executar a operação \"%s\" porque o agente de sincronização não está em execução";
"ose[-12042]" = "Ocorreu um erro no Transporte de Usuários (veja a causa)";
"bgsync[12001]" = "O agente de sincronização foi interrompido";
"bgsync[12502]" = "Enviar";
"bgsync[-12500]" = "A composição da prioridade %d falhou para o banco de dados \"%s\" (veja a causa)";
"osync_res[16101]" = "Informações do Agente de Sincronização";
"bgsync[-12516]" = "O agente não pode aceitar o comando de controle \"%s\" porque está no estado \"%s\"";
"ose[-12022]" = "Não foi possível encontrar transação com id %ld";
"olstd[-10301]" = "Erro durante o estabelecimento de conexão do cliente da fila de mensagens externa";
"ose[-12038]" = "Ocorreu um erro do servidor (veja a causa)";
"olstd[-10108]" = "Ocorreu um erro de soquete (veja a causa)";
"ospsqlite[-13002]" = "Definição de coluna inválida recebida";
"ose[-12002]" = "Não foi possível encontrar o banco de dados \"%s\"";
"ose[-12018]" = "Registro recuperado com LOB(s) para um plugin que não suporta LOBs";
"olstd[-10005]" = "\"%s\" não é suportado";
"olstd[-10214]" = "A tag \"%s\" não é reconhecida";
"bgsync[-12535]" = "A operação de controle sofreu timeout";
"ose[-12041]" = "Ocorreu um erro no Transporte Http (veja a causa)";
"bgsync[12000]" = "O agente de sincronização foi iniciado";
"bgsync[12501]" = "Preparar";
"ospsqlite[-13021]" = "Não é possível atualizar ou deletar o snapshot \"%s\" somente para leitura com a chave primária.";
"osync_res[16100]" = "Oracle Sync Agent";
"ose[-12021]" = "Não foi possível encontrar snapshot com id %ld";
"olstd[-10300]" = "A fila de mensagens \"%s\" está cheia";
"ose[-12037]" = "Erro ao salvar a configuração de sincronização (veja a causa)";
"olstd[-10107]" = "Timeout do soquete após %ld ms";
"ospsqlite[-13001]" = "Dados de snapshot inválidos recebidos";
"ose[-12001]" = "Esperava opcode '%c', recebeu '%c'";
"ose[-12017]" = "Não foi possível encontrar plugin com id %ld";
"olstd[-10004]" = "Foi encontrado um ponteiro ou handle nulo";
"olstd[-10213]" = "Não é possível encontrar tag filha \"%s\"";
"bgsync[-12534]" = "Handle de sessão inválido fornecido";
"olstd[-10209]" = "Os dados da tag estão em um formato inesperado";
"ose[-12040]" = "É necessário o banco de dados padrão para criar o snapshot \"%s\"";
"bgsync[12500]" = "Inativo";
"ose[-12056]" = "A chave pública do servidor está faltando e não foi possível obtê-la";
"bgsync[12015]" = "Desconhecido";
"bgsync[-12514]" = "Não é possível interromper o agente porque %d conexões ativas estão presentes";
"ospsqlite[-13020]" = "Duplicar meta snapshot: \"%s\"";
"ose[-12020]" = "Não foi possível encontrar snapshot \"%s\" na publicação \"%s\"";
"ose[-12036]" = "Erro ao carregar a configuração de sincronização (veja a causa)";
"olstd[-10106]" = "Título do chunk HTTP inválido:";
"ospsqlite[-13000]" = "Erro do banco de dados Sqlite (veja a causa)";
"ose[-12000]" = "A sincronização foi cancelada";
"ose[-12016]" = "Tipo de transporte inválido especificado: %d";
"olstd[-10003]" = "Argumento(s) inválido(s) \"%s\" especificado(s) para \"%s\"";
"olstd[-10212]" = "Esperava a tag \"%s\", obteve \"%s\"";
"bgsync[-12533]" = "Status inválido para aguardar por: %d";
"olstd[-10208]" = "Não há tags abertas suficientes";
"ose[-12055]" = "A sincronização em segundo plano não é possível neste momento (conclua a primeira sincronização ou configure a sincronização)";
"bgsync[12014]" = "Mensagem de rastreamento: %s";
"bgsync[-12513]" = "Notificação do servidor inválida recebida: \"%s\"";
"bgsync[-12529]" = "Não é possível iniciar o agente de sincronização porque outra instância já está em execução";
"osync_res[16114]" = "Informações sobre o Erro";
"olstd[-10105]" = "Linha de resposta HTTP inválida: \"%s\"";
"ose[-12035]" = "Resposta http malsucedida: \"%s\"";
"ospsqlite[-13015]" = "Erro de banco de dados do Sqlite; a recuperação é necessária (veja a causa)";
"bgsync[-12509]" = "Falha ao estabelecer conexão de discagem (veja a causa)";
"ose[-12015]" = "O tipo de transporte é usuário, mas o transporte do usuário não foi inicializado";
"olstd[-10002]" = "String base64 inválida: \"%s\"";
"olstd[-10211]" = "Esperava o evento %s, obteve %s";
"bgsync[-12532]" = "Parâmetro de string inválido especificado: %d";
"olstd[-10207]" = "Final do arquivo na tag \"%s\"";
"ose[-12054]" = "Não foi possível encontrar a chave do banco de dados para o banco de dados criptografado \\\"%s\\\"";
"bgsync[12013]" = "Rede avaliada, nome: \"\\%s\\\", velocidade: %ld bps, ping: %ld ms";
"bgsync[-12512]" = "Comando de controle inválido recebido: %d";
"bgsync[-12528]" = "Bancos de dados da plataforma duplicados encontrados: \"%s\" e \"%s\"";
"osync_res[16113]" = "Horário de Término";
"olstd[-10104]" = "URL inválido especificado: \"%s\"";
"ose[-12034]" = "Tipo de criptografia inválida especificada: %d";
"bgsync[12009]" = "A aplicação foi concluída para o banco de dados \"%s\"";
"bgsync[-12508]" = "Regra de plataforma encontrada \"%s\" no banco de dados que não é da plataforma \"%s\"";
"ospsqlite[-13014]" = "Id de snapshot %Id inválido para o snapshot \"%s\"";
"osync_res[16109]" = "Detalhes de Sincronização";
"ose[-12014]" = "Opção de string inválida especificada: %d";
"olstd[-10001]" = "Não há mais tokens no olStringTokenizer";
"olstd[-10210]" = "Tag sem terminação";
"bgsync[12407]" = "Anterior";
"bgsync[-12531]" = "Parâmetro de número inválido especificado: %d";
"olstd[-10206]" = "Tag final incompatível: \"%s\"";
"bgsync[-12547]" = "O agente de sinc. encontrou um erro fatal ou não pode ser interrompido";
"ose[-12053]" = "Não foi possível encontrar a chave da sessão ao fazer a recepção em um transporte de via única";
"bgsync[12304]" = "Ocultar UI";
"bgsync[12012]" = "Sem rede";
"bgsync[-12511]" = "A conexão de controle com o agente está fechada devido a um erro (veja a causa)";
"bgsync[-12527]" = "Consulta não encontrada para uma regra SQL";
"osync_res[16112]" = "Horário de Início";
"olstd[-10103]" = "Argumentos inválidos especificados para o monitor de progresso";
"ose[-12033]" = "URL de HTTP inválido especificado: \"%s\"";
"ose[-12049]" = "Falha ao retomar o recebimento de dados";
"bgsync[12008]" = "A aplicação foi iniciada para o banco de dados \"%s\"";
"bgsync[12201]" = "A memória está baixa (%ld bytes disponíveis)";
"bgsync[-12507]" = "Ocorreu um erro interno (a causa pode ter mais informações)";
"ospsqlite[-13013]" = "Ocorreu um erro interno (a causa pode ter mais informações)";
"osync_res[16108]" = "Carga da Bateria";
"ose[-12013]" = "Opção de inteiro inválida especificada: %d";
"ose[-12029]" = "Opcode de terminação inesperado encontrado durante o recebimento";
"olstd[-10000]" = "O texto na string \"%s\" não é um número válido";
"ospsqlite[-13009]" = "O snapshot com id %ld já existe";
"bgsync[12406]" = "Interrupção Pendente";
"ose[-12009]" = "API de Plugin \"%s\" não encontrada na biblioteca \"%s\"";
"bgsync[-12530]" = "\"%s\" não é suportado";
"olstd[-10205]" = "String sem terminação";
"bgsync[-12546]" = "Falha ao retomar agente de sinc. (veja a causa)";
"ose[-12052]" = "Apenas as direções SEND ou RECEIVE são permitidas para um transporte de via única";
"bgsync[12303]" = "Retomar";
"bgsync[12011]" = "A rede mudou de \"%s\" para \"%s\"";
"bgsync[-12510]" = "Falha ao processar notificação do servidor da prioridade %d para a publicação \"%s\" (veja a causa)";
"bgsync[-12526]" = "Tipo inválido \"%s\" para uma regra de condição";
"osync_res[16111]" = "Prioridade";
"olstd[-10102]" = "A chamada de transporte está fora da sequência";
"ose[-12032]" = "Recebeu dados não compactados incorretos";
"ose[-12048]" = "Falha ao retomar o envio de dados";
"bgsync[12007]" = "A sincronização da prioridade %d foi concluída para as publicações \"%s\"";
"bgsync[12200]" = "A carga da bateria está baixa (%d %%)";
"bgsync[-12506]" = "Ocorreu um erro no gerenciador de energia (veja a causa)";
"ospsqlite[-13012]" = "Argumento(s) inválido(s) passado(s) para a função";
"osync_res[16107]" = "Velocidade da Rede";
"ose[-12012]" = "Direção de sincronização inválida especificada: %d";
